W6D5/cats/app/views/cats/_cat.html.erb

        <ul>
            <% cat.cat_rental_requests.order(:start_date).each do |request| %>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY "cat_rental_requests"."start_date" ASC  [["cat_id", 2]]