W6D5/cats/app/models/cat_rental_request.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def overlapping_requests
    other_requests = CatRentalRequest.where.not(id: self.id)
    requests_for_same_cat = other_requests.where(cat_id: self.cat_id)
    overlapping_requests = requests_for_same_cat.where.not(
      "start_date > ? OR end_date < ?", self.end_date, self.start_date
    )

SELECT  1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" IS NOT NULL AND "cat_rental_requests"."cat_id" = $1 AND NOT (start_date > '2021-07-09' OR end_date < '2021-06-30') LIMIT $2  [["cat_id", 2], ["LIMIT", 1]]
---
  def does_not_have_overlap
    if overlapping_requests.exists?

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2021-07-06 16:42:00.366091"], ["id", 11]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (start_date > '2021-07-22' OR end_date < '2021-07-15')  [["id", 11], ["cat_id", 6]]
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2021-07-06 16:42:04.273865"], ["id", 2]]
---
  def approve!
    CatRentalRequest.transaction do
      self.update(status: "APPROVED")
      overlapping_requests.each do |request|
        request.update(status: "DENIED")