W6D5/cats/app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 2], ["start_date", "2021-06-30"], ["end_date", "2021-07-09"], ["created_at", "2021-07-06 02:51:43.009971"], ["updated_at", "2021-07-06 02:51:43.009971"]]
---
  def create
    cat_rental_request = CatRentalRequest.new(cat_rental_request_params)
    if cat_rental_request.save

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def approve
    if cat_rental_request = CatRentalRequest.find_by(id: params[:id])