W6D5/cats/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find_by(id: params[:id])
    if @cat
      if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["name", "Sallies"], ["updated_at", "2021-07-06 01:57:42.873407"], ["id", 1]]